sarusiy/JC-ESP32P4-M3/sdkconfig.defaults
# Auto-target a fresh checkout to esp32s3 without requiring a manual
# `idf.py set-target esp32s3` first.
CONFIG_IDF_TARGET="esp32s3"

# The N16R8 module: 16 MB flash, 8 MB Octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Allow DEBUG-level logs to be compiled in (still hidden by default at
# runtime) -- same reasoning as the P4 board's sdkconfig.
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# Native Bluetooth (NimBLE) -- unlike the P4 board, this chip has its own
# BT controller, no hosted/VHCI link to a co-processor needed at all.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
# CONFIG_BT_NIMBLE_TRANSPORT_UART is not set

# ESP32-S3 (like P4) has a native USB-Serial/JTAG peripheral separate from
# its general-purpose USB OTG pins -- make it the console so flash/monitor
# and stdin/stdout both work over the same port without needing the
# onboard FTDI chip at all. Confirmed working pattern on the P4 board's
# own sdkconfig; bring-up firmware's whole point right now is confirming
# it also holds on this board.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# OTA-capable partition table (see partitions.csv) -- carried over from the
# P4 board's design, sized for the same 16MB flash this module also has.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Pinned for the same reason as the P4 board's sdkconfig.defaults: keeps a
# fresh checkout building the same toolchain choice that's actually been
# tested, rather than whatever ESP-IDF's current Kconfig defaults resolve
# to on a from-scratch config.
CONFIG_LIBC_NEWLIB=y
# CONFIG_LIBC_PICOLIBC is not set
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR is not set
CONFIG_FREERTOS_IN_IRAM=y
